Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And on the first day of unleavened bread, when the Passover lamb is put to death, his disciples said to him, Where are we to go and make ready for you to take the Passover meal?
chr: ᎢᎬᏱᏱᏃ ᎢᎦ ᎾᎪᏔᏅᎾ ᎦᏚ ᎠᎩᏍᏗᏱ, ᎾᎯᏳ ᎤᏂᎸ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ, ᎬᏩᏍᏓᏩᏗᏙᎯ ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ, ᎭᏢ ᏣᏚᎵ ᏬᎦᏛᏅᎢᏍᏙᏗᏱ, ᎧᏃᎯᏰᎩ ᏣᎵᏍᏓᏴᏗᏱ?

source: And he sent two of his disciples, and said to them, Go into the town, and there will come to you a man with a vessel of water: go after him;
chr: ᏚᏅᏎᏃ ᎠᏂᏔᎵ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏗᎦᏚᎲ ᎢᏍᏕᎾ, ᏙᏓᏣᏠᏏᏃ ᎠᏍᎦᏯ ᎠᏰᎮᏍᏗ ᎠᏖᎵᏙ ᎠᎹ ᎠᏟᏍᏕᏍᏗ; ᎡᏍᏗᏍᏓᏩᏕᏒᎭ.

source: And wherever he goes in, say to the owner of the house, The Master says, Where is my guest-room, where I may take the Passover with my disciples?
chr: ᎢᎸᎯᏢᏃ ᏩᏴᎸᎭ, ᎯᎠ ᏁᏍᏗᏪᏎᎸᎭ ᎠᏍᎦᏯ ᎦᏁᎳ, ᏗᏕᏲᎲᏍᎩ ᎯᎠ ᏂᎦᏪᎭ, ᎭᏢ ᎠᏁᏙᎯ ᎤᏂᏴᏍᏗᏱ, ᎾᎿ ᎧᏃᎯᏰᎩ ᎢᏧᎳᎭ ᎣᎦᎵᏍᏓᏴᏗᏱ ᎬᎩᏍᏓᏩᏗᏙᎯ.

source: And he will take you up himself to a great room with a table and seats: there make ready for us.
chr: ᏓᏍᏓᏎᎮᎵᏃ ᎤᏛᏅ ᎦᎸᎳᏗ ᎧᏅᏑᎸᎢ, ᎦᏳᎳ ᎬᎿᎢ, ᎠᎴ ᎠᏛᏅᎢᏍᏔᏅᎯ; ᎾᎿ ᏍᎩᏯᏛᏅᎢᏍᏓᏁᎸᎭ.

source: And the disciples went out and came into the town, and saw that it was as he had said: and they made ready the Passover.
chr: ᎬᏩᏍᏓᏩᏗᏙᎯᏃ ᎤᏁᏅᏎ ᎠᎴ ᏗᎦᏚᎲ ᏭᏂᎷᏤᎢ, ᎠᎴ ᏭᏂᏩᏛᎮ ᎾᏍᎩᏯ ᏂᏚᏪᏎᎸᎢ; ᎤᎾᏛᏅᎢᏍᏔᏁᏃ ᎧᏃᎯᏰᎩ ᏗᎵᏍᏓᏴᏗᏱ.

source: And when it was evening he came with the twelve.
chr: ᎤᏒᏃ ᏄᎵᏍᏔᏅ ᎤᎷᏤ ᏓᏖᏁᎮ ᏔᎳᏚ ᎢᏯᏂᏛ.

source: And while they were seated taking food, Jesus said, Truly I say to you, One of you will be false to me, one who is taking food with me.
chr: ᎾᏍᎩᏃ ᎠᏂᏅᏜᎡᎢ ᎠᎴ ᎠᎾᎵᏍᏓᏴᎲᏍᎨᎢ, ᏥᏌ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎠᏏᏴᏫ ᎯᎠ ᏥᏂᏣᏛᏅ ᎢᏧᎳᎭ ᏦᏍᏓᎵᏍᏓᏴᎲᏍᎦ, ᏛᏆᏡᏔᏂ.

source: They were sad, and said to him one by one, Is it I?
chr: ᎤᎾᎴᏅᎮᏃ ᎤᏲ ᎤᏂᏰᎸᏁᎢ, ᎠᎴ ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ, ᏌᏉ ᎬᏪᏒᏛ, ᏥᎪ ᎠᏴ? ᏅᏩᏓᎴᏃ, ᏥᎪ ᎠᏴ? ᎠᏗᏍᎨᎢ.

source: And he said to them, It is one of the twelve, one who is putting his bread with me into the same plate.
chr: ᎤᏁᏨᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎠᏏᏴᏫ ᏔᎳᏚ ᎢᏥᏛ ᎨᏒ ᎾᏍᎩ ᎢᏧᎳᎭ ᎠᏖᎵᏙᎩᎯ ᏦᏍᏓᏑᏩᏍᎦ.

source: The Son of man goes, even as the Writings say of him: but cursed is that man through whom the Son of man is given up! It would have been well for that man if he had never been given birth.
chr: ᏴᏫ ᎤᏪᏥ ᎤᏙᎯᏳᎯ ᎤᏪᏅᏍᏗ ᎾᏍᎩᏯ ᏂᎬᏅ ᎪᏪᎸ ᎠᏥᏃᎮᏍᎬᎢ; ᎠᏎᏃ ᎤᏲᎢᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎾᏍᎩ ᎠᏍᎦᏯ ᏴᏫ ᎤᏪᏥ ᎠᏡᏗᏍᎩ! ᎣᏏᏳ ᏱᎨᏎ ᎢᏳᏃ ᎾᏍᎩ ᎠᏍᎦᏯ ᏄᏕᏅᎾᏉ ᏱᎨᏎᎢ.

source: And while they were taking food, he took bread, and after blessing it, he gave the broken bread to them, and said, Take it: this is my body.
chr: ᎠᎾᎵᏍᏓᏴᎲᏍᎬᏃ ᏥᏌ ᎦᏚ ᎤᎩᏒ, ᎠᎴ ᎤᎵᎮᎵᏨ, ᎤᎬᎭᎷᏰᎢ, ᎠᎴ ᏚᏁᎴᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏥᎩ, ᎢᏥᎦ; ᎯᎠ ᎾᏍᎩ ᎠᏴ ᏥᏰᎸᎢ.

source: And he took a cup, and when he had given praise, he gave it to them: and they all had a drink from it.
chr: ᎠᎴ ᎤᎵᏍᏈᏗ ᎤᎩᏒ, ᎠᎴ ᎤᎵᎮᎵᏨ, ᎾᏍᎩ ᏚᏁᎴᎢ; ᏂᎦᏛᏃ ᎾᏍᎩ ᎤᎾᏗᏔᎮᎢ.

source: And he said to them, This is my blood of the testament, which is given for men.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎯᎠ ᎾᏍᎩ ᎠᏴ ᎠᎩᎩᎬ ᎢᏨ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎾᏍᎩ ᎤᏂᏣᏘ ᏥᎨᎦᏤᏪᎸ.

source: Truly I say to you, I will take no more of the fruit of the vine till the day when I take it new in the kingdom of God.
chr: ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎥᏝ ᎿᏉ ᎢᎸᎯᏳ ᏴᎦᎦᏗᏔ ᏖᎸᎳᏗ ᎤᎾᏄᎪᏫᏒᎯ, ᎬᏂ ᎾᎯᏳ ᎢᎦ ᎢᏤ ᎦᏗᏔᎲᎭ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎪᎯ.

source: And after a song of praise to God they went out to the Mountain of Olives.
chr: ᏚᏂᏃᎩᏒᏃ, ᎤᏂᏄᎪᏤ ᎣᎵᏩᏲ ᎣᏓᎸ ᏭᏂᎶᏎᎢ.

source: And Jesus said to them, You will all be turned away from me: for it is in the Writings, I will put the keeper of the sheep to death, and the sheep will be put to flight.
chr: ᏥᏌᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏂᏥᎥ ᏂᎯ ᏙᏓᏦᏕᎵ ᎪᎯ ᏒᏃᏱ ᏥᎩ, ᎠᏴ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ; ᎯᎠᏰᏃ ᏂᎬᏅᎢᎪᏪᎳ, ᎠᏫ ᏗᎦᏘᏯ ᏓᏥᏴᏂᎵ, ᎤᏂᏃᏕᎾᏃ ᏛᎾᏗᎦᎴᏲᏥ.

source: But after I have come back from the dead, I will go before you into Galilee.
chr: ᎠᏎᏃ ᎿᏉ ᏗᏆᎴᏅᎯ ᎨᏎᏍᏗ, ᎢᎬᏱ ᏓᏨᏰᏅᎡᎵ ᎨᎵᎵ ᎢᏴᏛ.

source: But Peter said to him, Though the others may be turned away from you, I will not.
chr: ᎠᏎᏃ ᏈᏓ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎾᏍᏉ ᏂᎦᏛ ᏱᏚᏃᏕᏍᏔᏅ, ᎠᏴ ᎠᏎ ᎥᏝ.

source: And Jesus said to him, Truly, I say to you that you, today, even this night, before the cock's second cry, will say three times that you have no knowledge of me.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᎬᏪᏎᎭ, ᎾᏍᎩ ᎪᎯ ᎢᎦ, ᎠᎴ ᎪᎯᏉ ᏒᏃᏱ, ᎠᏏ ᏔᎵᏁ ᎾᏂᏴᎬᎾ ᏣᏔᎦ, ᏦᎢ ᏅᏓᏍᏆᏓᏱᎵ.

source: But he said with passion, If I have to be put to death with you, I will not be false to you. And they all said the same.
chr: ᎠᏎᏃ ᎤᏟ ᎤᎵᏂᎩᏛ ᎤᏁᏤ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏳᏃ ᎾᏍᏉ ᎢᏧᎳᎭ ᏗᎩᏂᏲᎱᎯᏍᏗ ᏱᎩ, ᎠᏎ ᎥᏝ ᏴᎦᎬᏯᏓᏱᎦ. ᎾᏍᎩᏯ ᎾᏍᏉ ᏄᏂᏪᏎ ᏂᎦᏛ.

source: And they came to a place which was named Gethsemane: and he said to his disciples, Be seated here while I say a prayer.
chr: ᎨᏎᎻᏂᏃ ᏚᏙᎥ ᎤᏂᎷᏤᎢ; ᎯᎠᏃ ᏂᏚᏪᏎᎴ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᎠᏂ ᎢᏥᏁᏍᏗ, ᏫᎦᏓᏙᎵᏍᏗᏍᎬ ᎢᎪᎯᏛ.

source: And he took with him Peter and James and John, and grief and great trouble came on him.
chr: ᏚᏖᏅᏎᏃ ᏈᏓ ᎠᎴ ᏥᎻ ᎠᎴ ᏣᏂ, ᎠᎴ ᎤᎴᏅᎮ ᎤᏣᏘ ᎤᏕᏯᏔᏁᎴᎢ, ᎠᎴ ᎤᏣᏘ ᎡᎯᏍᏗ ᎤᏓᏅᏓᏕᎢ;

source: And he said to them, My soul is very sad, even to death: be here a little time, and keep watch.
chr: ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎠᏆᏓᏅᏙ ᎤᏣᏘ ᎤᏕᏯᏔᏁᎭ ᎠᏲᎱᎯᏍᏗ ᎾᏍᎩᏯᎢ; ᎠᏂ ᎢᏥᏁᏍᏗ, ᎠᎴ ᎢᏥᏯᏫᏍᎨᏍᏗ.

source: And he went forward a little, and falling down on the earth, made request that, if possible, the hour might go from him.
chr: ᎤᏍᏗᎩᏛᏃ ᎢᏴᏛ ᎢᎤᏪᏅ, ᎡᎳᏗ ᎤᏓᏅᏁᎢ, ᎠᎴ ᎤᏓᏙᎵᏍᏔᏁ, ᎤᏔᏲᎴᎢ, ᎾᏍᎩ ᏰᎵ ᎢᎬᏩᎵᏍᏙᏗ ᏱᎩ, ᎾᎯᏳ ᎨᏒ ᎤᎶᎯᏎᏗᏱᏉ.

source: And he said, Abba, Father, all things are possible to you; take away this cup from me: but even so let not my pleasure, but yours be done.
chr: ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎠᏆ, ᎡᏙᏓ, ᏂᎯ, ᎨᏒ ᏰᎵᎦᏯᏉ ᎢᎨᏣᏛᏁᏗ ᏂᎦᎥᎢ; ᏍᎩᎲᏏᏉ ᎯᎠ ᎾᏍᎩ ᎤᎵᏍᏈᏗ; ᎥᏝᏍᎩᏂᏃᏅ ᎠᏴ ᎠᏆᏚᎵᏍᎬᎢ, ᏂᎯᏍᎩᏂ ᏣᏚᎵᏍᎬᎢ.

source: And he came, and saw them sleeping, and said to Peter, Simon, are you sleeping? were you not able to keep watch one hour?
chr: ᎢᎤᎷᏤᏃ ᎠᎴ ᏚᏩᏛᎮ ᎠᏂᎵᎾᎡᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴ ᏈᏓ, ᏌᏩᏂ, ᎯᎵᎭᏉᏧ? ᏝᏍᎪ ᏑᏟᎶᏛᏉ ᎢᎪᎯᏛ ᎾᏍᏉ ᎨᏣᏯᏫᏍᏗ ᏱᎨᏎᎢ?

source: Keep watch with prayer, so that you may not be put to the test; the spirit truly is ready, but the flesh is feeble.
chr: ᎢᏥᏯᏫᏍᎨᏍᏗ ᎠᎴ ᎢᏣᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᎾᏍᎩ ᏞᏍᏗ ᎤᏓᎴᎾᏍᏗᏱ ᏫᏥᎾᏄᎪᏨᎩ; ᎠᏓᏅᏙ ᎤᏙᎯᏳᎯ ᎤᏛᏅᎢᏍᏗ, ᎤᏇᏓᎸᏍᎩᏂ ᎠᏩᎾᎦᎳᎯᏳ.

source: And again he went away, and said a prayer, using the same words.
chr: ᏔᎵᏁᏃ ᎢᏴᏛ ᏭᎶᏒ, ᎤᏓᏙᎵᏍᏔᏁᎢ, ᏄᏪᏒ ᎾᏍᎩᏯ ᏫᏄᏪᏎᎢ.

source: And again he came and saw them sleeping, because their eyes were very tired; and they had nothing to say in answer.
chr: ᏗᎤᎷᏨᏃ ᏚᏩᏛᎮ ᏔᎵᏁ ᎠᏂᎵᎾᎡᎢ, ᏗᏂᎦᏙᎵᏰᏃ ᏗᎦᎨᏗᏳ ᎨᏎᎢ, ᎥᏝ ᎠᎴ ᏱᏂᎦᏔᎮ ᎢᏳᏂᏪᏍᏗᏱ ᎤᏂᏁᏤᏗᏱ.

source: And he came the third time, and said to them, Go on sleeping now and take your rest: it is enough; the hour has come; see, the Son of man is given up into the hands of evil men.
chr: ᏦᎢᏁᏃ ᏫᏚᎷᏤᎴᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎨᏥᎵᏁᏍᏗᏉ ᎿᏉ, ᎠᎴ ᎢᏣᏣᏪᏐᎸᏍᏓ; ᎿᏉ ᎦᎶᏐᎾ--ᎿᏉ ᎠᏍᏆᎸ ᎾᎯᏳ ᎨᏒᎢ; ᎬᏂᏳᏉ ᏴᏫ ᎤᏪᏥ ᎠᏂᏍᎦᎾ ᏕᎨᏥᏲᎯᏏ.

source: Get up, let us be going; see, he who gives me up is near.
chr: ᏗᏣᎴᎲᎦ, ᎢᏕᎾ; ᎬᏂᏳᏉ ᎠᏆᏡᏗᏍᎩ ᎡᏍᎦᏂᏳ ᏓᏯᎢ.

source: And straight away, while he was still talking, Judas, one of the twelve, came, and with him a great band with swords and sticks, from the chief priests and the scribes and those in authority.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎠᏏᏉ ᎦᏪᏂᏍᎨᎢ, ᏧᎾᎸᎪᏤ, ᏧᏓᏏ, ᎠᏏᏴᏫ ᏔᎳᏚ ᎢᏯᏂᏛ ᎨᏒ, ᏓᏘᏁᎮ ᎤᏂᏣᏘ, ᎠᏰᎳᏍᏗ-ᏗᎦᏅᎯᏛ ᎠᎴ ᎠᏓ ᏗᏂᏁᎯ, ᏅᏓᎬᏩᏂᏅᏏᏛ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ, ᎠᎴ ᏗᏃᏪᎵᏍᎩ, ᎠᎴ ᏗᏂᎳᏫᎩ.

source: Now he who had been false to him had given them a sign, saying, The one to whom I give a kiss, that is he; take him, and get him away safely.
chr: ᎤᏡᏗᏍᎩᏃ ᎬᏂᎨᏒ ᎢᏧᏩᏁᎸᎯ ᎨᏎ ᎤᎾᏙᎴᎰᎯᏍᏙᏗ, ᎯᎠ ᎢᏳᏪᏒᎯ ᎨᏎᎢ, ᎩᎶ ᏥᏯᏚᏣᎳᏅᎭ, ᎾᏍᎩ ᎨᏎᏍᏗ, ᏒᏥᏂᏴᎲᎭ, ᎡᏣᏘᎾᏫᏛᎲᎭ ᎬᏩᏚᏓᎴᏍᏗ ᏂᎨᏒᎾ ᏁᏨᏁᏍᏗ.

source: And when he had come, he went straight to him and said, Master; and gave him a kiss.
chr: ᎤᎷᏨᏉᏃ ᎩᎳᏉ ᎢᏴᏛ ᏭᎷᏤᎴᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᏗᏍᏇᏲᎲᏍᎩ, ᏗᏍᏇᏲᎲᏍᎩ; ᎠᎴ ᎤᏚᏣᎳᏁᎢ.

source: And they put their hands on him, and took him.
chr: ᏕᎬᏩᏏᏔᏕᏃ, ᎠᎴ ᎬᏩᏂᏴᎮᎢ.

source: But a certain one of those who were near took out his sword, and gave the servant of the high priest a blow, cutting off his ear.
chr: ᎠᏏᏴᏫᏃ ᎾᎥ ᎠᏂᏙᎿᎢ, ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᎤᎸᎮᎢ, ᎠᎴ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎤᏅᏏᏓᏍᏗ ᎤᎷᏰ ᎠᎴ ᎤᎵᏍᏕᏍᏔᏁᎢ.

source: And Jesus said to them, Have you come out as against a thief, with swords and sticks to take me?
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏥᎪ ᎦᏃᏍᎩᏍᎩ ᏨᏤᏥᏂᏴᎯᏐ ᎾᏍᎩᏯ ᎢᏥᎷᎩ, ᏗᏥᏁᎯ ᎠᏰᎳᏍᏗ-ᏗᎦᏅᎯᏛ ᎠᎴ ᎠᏓ ᎠᏴ ᏍᎩᏂᏴᎰᎦ?

source: I was with you every day in the Temple teaching, and you did not take me; but this is done so that the Writings may come true.
chr: ᏂᏚᎩᏨᏂᏒ ᎢᏨᏰᎳᏗᏙᎲᎩ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᏕᎦᏕᏲᎲᏍᎬᎩ, ᎠᎴ ᎥᏝ ᏱᏍᎩᏂᏴᎮᎢ; ᎤᏙᎯᏳᏗᏍᎩᏂᏃᏅ ᏂᎬᏅ ᎪᏪᎸᎢ.

source: And they all went away from him in fear.
chr: ᏂᎦᏗᏳᏃ ᎬᏩᏕᏦᏁᎢ, ᎠᎴ ᎤᎾᎵᏎᎢ.

source: And a certain young man went after him, with only a linen cloth about his body; and they put their hands on him;
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᎠᏫᏅ ᎤᏍᏓᏩᏛᏎᎢ, ᏙᎴᏛ ᎠᏄᏬ ᎤᏓᏇᏅᏕ ᎤᏰᎸᎭ ᎨᏒᎢ; ᎠᏂᏫᏅᏃ ᎬᏩᏂᏴᎮᎢ.

source: But he got away unclothed, without the linen cloth.
chr: ᏙᎴᏛᏃ ᎠᏄᏬ ᎤᏂᏰᎢ, ᎠᎴ ᎤᏰᎸᎭ ᏚᎵᏘᎡᎴᎢ.

source: And they took Jesus away to the high priest; and there came together with him all the chief priests and those in authority and the scribes.
chr: ᏥᏌᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏧᏬᎸ ᏭᎾᏘᏅᏍᏔᏁᎢ; ᎾᏍᎩᏃ ᏕᎬᏩᎳᏫᎡ ᏂᎦᏛ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ, ᎠᎴ ᏗᏂᎳᏫᎩ, ᎠᎴ ᏗᏃᏪᎵᏍᎩ.

source: And Peter had come after him at a distance, even into the house of the high priest; and he was seated with the captains, warming himself in the light of the fire.
chr: ᏈᏓᏃ Ꭸ ᎢᏴᏛ ᎤᏍᏓᏩᏗᏎᎢ, ᎾᏍᎩ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏗᎦᏁᎸ ᏭᏴᎴᎢ, ᎤᏬᎴᏃ ᎨᏥᏅᏏᏓᏍᏗ ᎠᏂᏅᎢ, ᎠᎴ ᎪᏛ ᎤᎦᎾᏬᏍᎨᎢ.

source: Now the chief priests and all the Sanhedrin were looking for witness against Jesus so that they might put him to death; and they were unable to get any.
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏂᎦᏛ ᏓᏂᎳᏫᎥ ᎤᏂᏲᎮ ᎤᏂᏃᎮᎸᎯ ᏥᏌ ᎤᏡᏗᏍᎩ, ᎾᏍᎩ ᎤᏂᎯᏍᏗᏱ, ᎤᎾᏠᏤᏃ.

source: For a number gave false witness against him and their witness was not in agreement.
chr: ᎤᏂᏣᏖᏰᏃ ᎦᏰᎪᎩ ᎠᏂᏃᎮᏍᎩ ᎬᏩᏡᏗᏍᎨᎢ, ᎠᏎᏃ ᎠᏂᏃᎮᏍᎬ ᎥᏝ ᎤᏠᏱ ᏱᎨᏎᎢ.

source: Then some got up and gave false witness against him, saying,
chr: ᏚᎾᎴᏁᏃ ᎩᎶ ᎢᏳᎾᏍᏗ ᎠᎴ ᎦᏰᎪᎩ ᎤᏂᏃᎮᎴ ᎬᏩᏡᏗᏍᎬᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ;

source: He said in our hearing, I will put an end to this Temple which is made with hands, and in three days I will make another without hands.
chr: ᎣᎦᏛᎦᏅᎩ ᎯᎠ ᏂᎧᏪᏍᎬᎩ, ᏓᏥᏲᏍᏔᏂ ᎯᎠ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎾᏍᎩ ᏗᎪᏱ ᏗᎬᏔᏅᎯ ᎪᏢᏅᎯ, ᏦᎢᏉᏃ ᏧᏒᎯᏛ ᏛᏥᏱᎵᏙᎵ ᏛᎦᏁᏍᎨᎯ ᏅᏩᏓᎴ ᏗᎪᏱ ᏗᎬᏔᏅᎯ ᏂᎨᏒᎾ.

source: And even so their witness was not in agreement.
chr: ᎠᏎᏃ ᎾᏍᏉ ᎾᏍᎩ ᎤᏂᏃᎮᎸᎯ ᎥᏝ ᎤᏠᏱ ᏱᎨᏎᎢ.

source: And the high priest got up in the middle of them, and said to Jesus, Do you say nothing in answer? what is it which these say against you?
chr: ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᎠᏰᎵ ᎤᎴᏅ, ᎤᏛᏛᏁ ᏥᏌ, ᎯᎠ ᏁᏪᏎᎢ, ᏝᏍᎪ ᎪᎱᏍᏗ ᏯᏗᎭ? ᎦᏙ ᎾᏍᎩ ᎯᎠ ᏣᏂᏃᎮᎭ ᎨᏣᏡᏗᏍᎬᎢ?

source: But he kept quiet and said nothing. Again the high priest questioning him said, Are you the Christ, the son of the Holy One?
chr: ᎠᏎᏃ ᎡᎳᏪᏉ ᎤᏩᏎᎢ, ᎠᎴ ᎥᏝ ᎪᎱᏍᏗ ᏳᏛᏁ ᏨᏁᏤᎢ. ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᏔᎵᏁ ᎤᏛᏛᏁ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏂᎯᏍᎪ ᎦᎶᏁᏛ, ᎠᏥᎸᏉᏗ ᎤᏪᏥ?

source: And Jesus said, I am: and you will see the Son of man seated at the right hand of power, and coming with the clouds of heaven.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎠᏴ ᎾᏍᎩ; ᎠᎴ ᏓᏰᏥᎪᎢ ᏴᏫ ᎤᏪᏥ ᎤᏬᎴᏍᏗ ᎠᎦᏘᏏ ᎢᏗᏢ ᎤᎵᏂᎩᏛ ᎨᏒᎢ, ᎠᎴ ᏣᎢᏎᏍᏗ ᎤᎶᎩᎸ ᎦᎸᎶᎢ.

source: And the high priest, violently parting his robes, said, What more need have we of witnesses?
chr: ᏄᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎨᎶᎯ ᏚᏄᏩᎥ ᏚᏪᏣᎦᎸᎮᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎦᏙᏃ ᎠᏏ ᏱᏗᎦᏚᎵ ᎠᏂᏃᎮᏍᎩ?

source: His words against God have come to your ears: what is your opinion? And they all said it was right for him to be put to death.
chr: ᎢᏣᏛᎬᎦ ᎠᏐᏢᎢᏍᏗᏍᎬᎢ; ᎦᏙ ᎢᏤᎵᎭ? ᏂᎦᏛᏃ ᏕᎬᏭᎪᏓᏁᎴ ᏰᎵᏉ ᎬᏩᏲᎱᎯᏍᏗ ᎨᏒᎢ.

source: And some put shame on him and, covering his face, gave him blows and said to him, Now say what is to come: and the captains took him and gave him blows with their hands.
chr: ᎢᎦᏛᏃ ᎤᎾᎴᏅᎮ ᏕᎬᏩᎵᏥᏍᏆᏍᎨᎢ, ᎠᎴ ᎤᎧᏛ ᎬᏭᏢᏁᎮᎢ, ᎠᎴ ᎠᏍᏈᏅ ᏕᎬᏩᏂᏗᏍᎨᎢ, ᎠᎴ ᎯᎠ ᏂᎬᏩᏪᏎᎮᎢ, ᎭᏙᎴᎰᎯ; ᎠᎴ ᎨᏥᏅᏏᏓᏍᏗ ᏕᎬᏩᏂᎮᎢ.

source: And while Peter was down in the open square of the building, one of the servant-girls of the high priest came;
chr: ᏈᏓᏃ ᎡᎳᏗᏢ ᎾᎿ ᎠᏓᏁᎸ ᎡᏙᎮᎢ, ᎤᎷᏤ ᎠᏏᏴᏫ ᎠᎨᏴ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎤᏅᏏᏓᏍᏗ.

source: And seeing Peter warming himself by the fire, she gave him a look, and said, You were with this Nazarene, even Jesus.
chr: ᎾᏍᎩᏃ ᎤᎪᎲ ᏈᏓ ᎤᎦᎾᏬᏍᎬᎢ, ᏚᎧᎿᏁᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᏂᎯ ᎾᏍᏉ ᏥᏍᏕᏙᎲᎩ ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ.

source: But he said, I have no knowledge of him, or of what you are saying: and he went out into the doorway; and there came the cry of a cock.
chr: ᎠᏎᏃ ᎤᏓᏱᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎥᏝ ᏱᏥᎦᏔᎭ, ᎥᏝ ᎠᎴ ᏱᎪᎵᎦ ᏂᏪᏍᎬᎢ. ᎤᏄᎪᏤᏃ ᏙᏱᏗᏢ ᏩᏲᏓᏝᎲ ᏭᎶᏎᎢ; ᏣᏔᎦᏃ ᎤᏴᎵᏎᎢ.

source: And the girl saw him, and said again to those who were near, This is one of them.
chr: ᎠᏛᏃ ᏔᎵᏁ ᎤᎪᎮᎢ, ᎠᎴ ᎤᎴᏅᎮ ᎯᎠ ᏂᏚᏪᏎᎴ ᎾᎥ ᎠᏂᏙᎾᎢ, ᎯᎠ ᎾᏍᎩ ᎾᎿ ᎨᎳ.

source: But again he said it was not so. And after a little time, again those who were near said to Peter, Truly you are one of them; for you are a Galilaean.
chr: ᏔᎵᏁᏃ ᎤᏓᏱᎴᎢ. ᏂᎪᎯᎸᎾᏃ ᎣᏂ ᎾᏍᎩ ᎾᎥ ᎠᏂᏙᎾᎢ ᏔᎵᏁ ᎯᎠ ᏄᏂᏪᏎᎴ ᏈᏓ, ᎤᏙᎯᏳᎯ ᏂᎯ ᎾᎿ ᎮᎳ; ᎨᎵᎵᏰᏃ ᎮᎯ, ᎠᎴ ᎪᏬᏂᏍᎬ ᎤᏠᏱ ᎢᎩ.

source: But, with curses and oaths, he said, I have no knowledge of the man about whom you are talking.
chr: ᎠᏎᏃ ᎤᎴᏅᎮ ᎤᏍᎩᏅᏕ ᎠᎴ ᎤᏎᎵᏔᏁ ᎯᎠ ᏁᏪᏎᎢ, ᎥᏝ ᏱᏥᎦᏔᎭ Ꮎ ᎠᏍᎦᏯ ᎾᏍᎩ ᏤᏥᏃᎮᎭ.

source: And in the same minute, the cock gave a second cry. And it came to Peter's mind how Jesus had said to him, Before the cock's second cry, you will say three times that you have no knowledge of me. And at this thought he was overcome with weeping.
chr: ᏔᎵᏁᏃ ᎤᏴᎵᏎ ᏣᏔᎦ. ᏈᏓᏃ ᎤᏅᏓᏕ ᏥᏌ ᏄᏪᏒᎢ, ᎯᎠ ᏥᏄᏪᏎᎴᎢ, ᎠᏏ ᏣᏔᎦ ᏔᎵ ᏄᏴᎳᏒᎾ ᎨᏎᏍᏗ, ᏦᎢ ᏅᏓᏍᏆᏓᏱᎵ. ᎾᏍᎩᏃ ᎤᏓᏅᏖᎸ ᏚᏠᏱᎴᎢ.

source: And the first thing in the morning the chief priests, with those in authority and the scribes and all the Sanhedrin, had a meeting, and put cords round Jesus, and took him away, and gave him up to Pilate.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᏭᎩᏨᏅ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ, ᎠᎴ ᏧᎾᏛᏐᏅᎯ, ᎠᎴ ᏗᏃᏪᎵᏍᎩ, ᎠᎴ ᏂᎦᏛ ᏗᏂᎳᏫᎩ ᎤᎾᎵᏃᎮᎸ ᎤᎾᎸᎴ ᏥᏌ, ᎠᎴ ᎤᎾᏘᎾᏫᏛᎮᎢ, ᎠᎴ ᏆᎴᏗ ᏫᏚᏂᏲᎯᏎᎴᎢ.

source: And Pilate put a question to him, Are you the King of the Jews? And he, answering, said to him, You say so.
chr: ᏆᎴᏗᏃ ᎤᏛᏛᏁ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏂᎯᏍᎪ ᏣᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ? ᎤᏁᏨᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏰᎵᏉ ᏂᏫ.

source: And the chief priests said a number of things against him.
chr: ᏄᏂᎬᏫᏳᏒᏃ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎤᏣᏖ ᏧᏓᎴᏅᏛ ᎬᏭᎯᏍᏗᏍᎨᎢ.

source: And Pilate again put a question, Do you say nothing in answer? see how much evil they say you have done.
chr: ᏆᎴᏗᏃ ᏔᎵᏁ ᎤᏛᏛᏁ ᎯᎠ ᏄᏪᏎᎢ; ᏝᏍᎪ ᎪᎱᏍᏗ ᏯᏗᎭ? ᎬᏂᏳᏉ ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᎠᏂᏃᎮᎭ ᎨᏣᏡᏗᎭ.

source: But Jesus gave no more answers, so that Pilate was full of wonder.
chr: ᎠᏎᏃ ᏥᏌ ᎠᏏ ᎥᏝ ᎪᎱᏍᏗ ᏯᏗᏍᎨᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᏆᎴᏗ ᎤᏍᏆᏂᎪᏎᎢ.

source: Now at the feast every year he let one prisoner go free at their request.
chr: ᏓᎾᎵᏍᏓᏴᎲᏍᎬᏃ ᎢᏳᎢ ᏓᏲᎯᏎᎮ ᎠᏏᏴᏫ ᎠᏴᎩ, ᎾᏍᎩᏉ ᎠᏂᏔᏲᎭ.

source: And there was one named Barabbas, in prison with those who had gone against the government and in the fight had taken life.
chr: ᎠᏏᏴᏫᏃ ᎡᎮ ᏆᎳᏆ ᏧᏙᎢᏛ ᎾᏍᎩ ᎢᏧᎳᎭ ᏕᎨᎦᎸᎡ ᎬᏩᎵᎪᏁᎸᎯ ᎤᎾᏓᏑᏰᏛ ᎤᎾᎵᏖᎸᏅᎯ, ᎾᏍᎩ ᎤᎾᏓᎸᎯ ᎨᏎ ᎾᎯᏳ ᎤᎾᏓᏑᏰᏛ ᎤᎾᎵᏖᎸᏅᎢ.

source: And the people went up, requesting him to do as he had done for them in other years.
chr: ᎤᏂᏣᏘᏃ ᎠᏍᏓᏯ ᎤᎾᎵᏍᏕᎢ, ᎤᎾᎴᏅᎮ ᎤᏂᏔᏲᎴ ᎾᏍᎩᏯ ᏂᏚᏛᏁᎸ ᏧᏩᎫᏔᏅᏒ ᎢᏧᏛᏁᏗᏱ.

source: And Pilate said in answer to them, Is it your desire that I let the King of the Jews go free?
chr: ᏆᎴᏗᏃ ᏚᏁᏤᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏣᏚᎵᏍᎪ ᎤᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ ᏗᏳᏲᎯᏎᏗᏱ.

source: For he saw that the chief priests had given him up through envy.
chr: ᎠᎦᏔᎮᏰᏃ ᎾᏍᎩ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᏅᏳᏤᎲᏉ ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏕᎬᏩᏲᏒᎢ.

source: But the people were moved by the chief priests to make him let Barabbas go free.
chr: ᎠᏎᏃ ᏄᏂᎬᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᏄᏅᏂᏌᏁ ᎤᏂᏣᏘ ᏴᏫ, ᎾᏍᎩ ᏆᎳᏆ ᎤᏂᏔᏲᏍᏗᏱ ᏧᏲᎯᏎᏗᏱ.

source: And Pilate again said in answer to them, What then am I to do to him to whom you give the name of the King of the Jews?
chr: ᏆᎴᏗᏃ ᏔᎵᏁ ᎤᏁᏨ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᏣᏚᎵ ᏥᏴᏁᏗᏱ ᎾᏍᎩ Ꮎ ᎤᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ ᏤᏦᏎᎭ?

source: And they said again loudly, To the cross with him!
chr: ᏔᎵᏁᏃ ᎤᏁᎷᏁᎢ ᎯᏯᏛᎥᎦ ᎤᎾᏛᏁᎢ.

source: And Pilate said to them, Why, what evil has he done? But their cry was the louder, To the cross!
chr: ᏆᎴᏗᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ, ᎦᏙ ᎤᏍᏗ ᎤᏲ ᏚᎸᏫᏍᏓᏁᎸ? ᎠᏎᏃ ᎤᏟᏉ ᎢᏯᏍᏓᏯ ᎤᏁᎷᏁᎢ, ᎯᏯᏛᎥᎦ, ᎤᎾᏛᏁᎢ.

source: And Pilate, desiring to do what was pleasing to the people, let Barabbas go free, and gave up Jesus, when he had been whipped, to be put to death on the cross.
chr: ᏆᎴᏗᏃ ᎣᏏᏳ ᎤᏰᎸᏎ ᎣᏍᏛ ᏧᏓᏅᏓᏗᏍᏙᏗᏱ ᎤᏂᏣᏘ, ᏚᏲᎯᏎᎴ ᏆᎳᏆ, ᏥᏌᏃ ᎤᎵᎥᏂᎸ ᏚᏲᏎ ᎠᎦᏛᏗᏱ.

source: And the men of the army took him away into the square in front of the building which is the Praetorium, and they got together all the band.
chr: ᎠᏂᏯᏫᏍᎩᏃ ᎬᏩᏘᎾᏫᏛᎮ ᏫᎬᏩᏴᏔᏁ ᎤᎬᏫᏳᎯᏱ ᎠᏓᏁᎸᎢ ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᏣᏥᎳᏫᏤᏗᏱ, ᏂᎦᏛᏃ ᏑᎾᏓᏡᎩ ᏫᏚᏂᏯᏅᎮᎢ.

source: And they put a purple robe on him, and twisting a crown of thorns, they put it on him;
chr: ᎩᎦᎨᏃ ᎬᏩᏄᏪᎡᎢ, ᎠᎴ ᎠᎵᏍᏚᎶ ᏧᏣᏲᏍᏗ ᎪᏢᏔᏅᎯ ᎤᏂᏍᏕᏲᏅ, ᎾᏍᎩ ᎤᏂᏍᏚᎶᏔᏁᎢ.

source: And, as if honouring him, they said, Long life to the King of the Jews!
chr: ᎠᎴ ᎤᎾᎴᏅᎮ ᎠᏂᏲᎵᎮᎢ, ᎢᏨᏲᎵᎦ, ᏣᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ, ᎠᎾᏗᏍᎨᎢ.

source: And they gave him blows on the head with a stick and put shame on him and, going down on their knees, gave him worship.
chr: ᎠᏍᎪᎵᏃ ᏕᎬᏩᏂᎮ ᎦᎾᏍᏓ ᎬᏗ, ᎠᎴ ᏕᎬᏩᎵᏥᏍᏆᏍᎨᎢ, ᎠᎴ ᏓᎾᎵᏂᏆᏅᎥᏍᎨ ᎬᏩᏓᏙᎵᏍᏓᏁᎮᎢ.

source: And when they had made sport of him, they took the purple robe off him and put his clothing on him. And they took him out to put him to death on the cross.
chr: ᎤᎾᏕᎰᏔᏃᏅᏃ, ᎬᏩᏄᏪᏎ ᎩᎦᎨᎢ, ᎠᎴ ᎤᏩᏒ ᏧᏄᏬ ᏕᎬᏩᏄᏬᎡᎢ, ᎠᎴ ᏫᎬᏩᏘᏅᏍᏔᏁ ᎬᏩᏛᏗᏱ.

source: And they made one, Simon of Cyrene, the father of Alexander and Rufus, who was going by, coming from the country, go with them, so that he might take his cross.
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᏌᏩᏂ ᏧᏙᎢᏛ ᏌᎵᏂ ᎡᎯ ᎠᎢᏎᎢ, ᏙᏗᎦᎶᎨᏒ ᏅᏓᏳᎶᏒᎯ, ᎾᏍᎩ ᎡᎵᎩ ᎠᎴ ᎷᏆᏏ ᎤᏂᏙᏓ, ᎾᏍᎩ ᎤᏤᎵ ᏧᏓᎿᏩᏛ ᎤᏪᏅᏍᏗᏱ ᏄᏅᏁᎴᎢ.

source: And they took him to the place named Golgotha, which is, Dead Man's Head.
chr: ᎪᎵᎦᏓᏃ ᏚᏙᎥ ᏫᎬᏩᏘᏅᏔᏁᎢ, ᎾᏍᎩ ᎠᏁᏢᏔᏅᎯ ᎨᏒ ᎤᏍᏆᎷᎪ ᎦᏛᎦ.

source: And they gave him wine mixed with myrrh; but he did not take it.
chr: ᎬᏩᏁᏁᎴᏃ ᎤᏗᏔᏍᏗ ᎩᎦᎨᎠᏗᏔᏍᏗ ᎻᎳ ᎠᏑᎵ; ᎠᏎᏃ ᎥᏝ ᏳᏁᎩᏎᎢ.

source: And he was nailed to the cross; and they made a division of his clothing among them, putting to the decision of chance what everyone was to take.
chr: ᎿᏉᏃ ᏓᏓᎿᏩᏍᏛ ᎬᏩᏛᏅ ᎤᏂᏯᏙᎴ ᏧᏄᏬᎢ, ᎤᎾᏎᏒᎮ ᎤᎾᏙᎴᎰᎯᏍᏗᏱ ᎾᏍᎩ ᎠᏂᏏᏴᏫᎭ ᏧᏂᏁᏒᏍᏗ ᎨᏒᎢ.

source: And it was the third hour when they put him on the cross.
chr: ᏐᎣᏁᎳᏃ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒ ᎨᏎᎢ, ᎠᎴ ᎬᏩᏛᏁᎢ.

source: And the statement of his crime was put in writing on the cross, THE KING OF THE JEWS.
chr: ᎦᎸᎳᏗᏢᏃ ᎪᏪᎴ ᏄᏍᏛ ᎠᎫᎢᏍᏛᎢ, ᎯᎠ ᏂᎬᏁᎢ, ᎤᎬᏫᏳᎯ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ.

source: And they put two thieves on crosses with him, one on his right side, and one on his left.
chr: ᎢᏧᎳᎭᏃ ᏕᎨᎦᏛᏁ ᎠᏂᏔᎵ ᏗᎾᏓᎾᏌᎲᏍᎩ; ᎠᏏᏴᏫ ᎠᎦᏘᏏᏗᏢ, ᏐᎢᏃ ᎠᎦᏍᎦᏂ ᎢᏗᏢ.

source: And those who went by made sport of him, shaking their heads, and saying, Ha! you who give the Temple to destruction, and put it up again in three days,
chr: ᎠᏂᎶᏍᎩᏃ ᎦᎬᏩᏐᏢᏗᏍᎨᎢ, ᎠᎴ ᏓᎾᎵᏍᏛᏂᎮ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, Ᏺ, ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎯᏲᏍᏗᏍᎩ, ᎠᎴ ᏦᎢᏉᏉ ᎢᎦ ᎯᏱᎵᏙᎯ ᎭᏁᏍᎨᏍᎩ,

source: Keep yourself from death, and come down from the cross.
chr: ᏨᏒ ᎭᎵᏍᏕᎸ, ᎠᎴ ᎡᎭᏠᎠᎯ ᏓᏓᎿᏩᏍᏛᎢ.

source: In the same way the chief priests, laughing at him among themselves with the scribes, said, A saviour of others, he has no salvation for himself.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ ᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎬᏩᏕᎰᏗᏍᎬ, ᎯᎠ ᏂᏓᎾᏓᏪᏎᎮᎢ, ᏅᏩᎾᏓᎴ ᏓᏍᏕᎵᏍᎬᎩ; ᎤᏩᏒ ᎥᏝ ᏴᎬᎵᏍᏕᎸ.

source: Let the Christ, the King of Israel, come down now from the cross, so that we may see and have belief. And those who were put on crosses with him said evil things against him.
chr: ᎦᎶᏁᏛ ᎤᎬᏫᏳᎯ ᎢᏏᎵ ᎤᎾᏤᎵᎦ ᎿᏉ ᏩᏠᎠᎯ ᏓᏓᎿᏩᏍᏛᎢ, ᎾᏍᎩ ᎣᎩᎪᏩᏛᏗᏱ ᎠᎴ ᎣᎪᎯᏳᏗᏱ. ᎠᎴ ᎾᏍᎩ ᎢᏧᎳᎭ ᏗᎨᎦᏛᏅᎯ ᎦᎬᏩᏐᏢᏕᎢ.

source: And when the sixth hour had come, it was dark over all the land till the ninth hour.
chr: ᏔᎳᏚᏃ ᎢᏳᏟᎶᏛ ᎤᎵᏰᎢᎶᎸ ᎤᎵᏏᎲᏎ ᏂᎬᎾᏛ ᎾᎿ ᎦᏙᎯ, ᏦᎢ ᎢᏳᏟᎶᏛ ᎢᏯᏍᏘ.

source: And at the ninth hour, Jesus said in a loud voice, Eloi, Eloi, lama sabachthani? which is, My God, my God, why are you turned away from me?
chr: ᏦᎢᏁ ᎢᏳᏟᎶᏛ ᎤᎵᏰᎢᎶᎸ ᏥᏌ ᎠᏍᏓᏯ ᎤᏪᎷᏁᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎢᎶᎢ, ᎢᎶᎢ, ᎳᎹ ᏌᏆᏓᏂ? ᎾᏍᎩ ᎠᏁᏢᏔᏅᎯ ᎯᎠ ᏄᏍᏗ ᎦᏛᎦ, ᎠᏆᏁᎳᏅᎯ, ᎠᏆᏁᎳᏅᎯ, ᎦᏙᏃ ᎥᏍᏋᏕᎩ?

source: And some of those who were near, hearing it, said, See, he is crying to Elijah.
chr: ᎢᎦᏛᏃ ᎾᎥ ᎠᏂᏙᎾᎢ ᎤᎾᏛᎦᏅ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᎬᏂᏳᏉ, ᎢᎳᏯ ᎠᏯᏂᎭ.

source: And one of them went quickly and, getting a sponge full of bitter wine, put it on a rod, and gave it to him for drink, saying, Let be; let us see if Elijah will come to take him down.
chr: ᎠᏎᏴᏫᏃ ᏚᏍᏆᎸᏔᏅ, ᎠᎴ ᏚᏬᎵ ᏧᏂᏦᏯᏍᏗ ᏭᎧᎵᎢᏍᏔᏅ, ᎠᎴ ᎦᎾᏍᏙᎯ ᎤᏪᏆᏔᏅ, ᎤᏁᏁᎸ ᎤᏗᏔᏍᏗ; ᎯᎠ ᏄᏪᏎᎢ, ᎤᏁᎳᎩ, ᎢᏓᏙᎴᎰᎯ, ᏥᎪᏃ ᎢᎳᏯ ᏓᎦᎷᏥ ᏓᏳᏠᎥᏔᏂᎵ.

source: And Jesus gave a loud cry, and gave up his spirit.
chr: ᏥᏌᏃ ᎠᏍᏓᏯ ᎤᏪᎷᏅ, ᎤᎵᏍᏆᏕᎴᎢ.

source: And the curtain of the Temple was parted in two from end to end.
chr: ᎠᏰᏙᎳᏛᏗᏃ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎦᏛ ᎤᏓᏣᎦᎸᎮ ᏔᎵ ᏄᏓᏕᎢ, ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᏛ ᎡᎳᏗ ᏩᏍᏗ.

source: And when the captain, who was near, saw how he gave up his spirit, he said, Truly this man was a son of God.
chr: ᎠᏍᎪᎯᏧᏈᏃ ᏗᏘᏂᏙᎯ ᎠᎢᏗᏢ ᏧᏳᎪᏗ ᎦᏙᎩ, ᎤᏙᎴᎰᏒ ᎾᏍᎩ ᎤᏪᎷᏅᎢ, ᎠᎴ ᎤᎵᏍᏆᏕᎸᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎤᏙᎯᏳᎯ ᎯᎠ ᎠᏍᎦᏯ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎨᏎᎢ.

source: And there were women watching from a distance: among them were Mary Magdalene, and Mary, the mother of James the less and of Joses, and Salome,
chr: ᎠᏂᎨᏴᏃ ᎾᏍᏉ Ꭸ ᎢᏴᏛ ᏙᏗᏂᎧᏁᎢ; ᎾᎿᏃ ᎠᏁᎴ ᎺᎵ ᏑᎩᏕᎵ ᎡᎯ, ᎠᎴ ᎺᎵ ᏥᎻ ᎤᏍᏗ ᎠᎴ ᏦᏏ ᎤᏂᏥᎢ, ᎠᎴ ᏌᎶᎻ.

source: Who went with him when he was in Galilee and took care of him; and a number of other women who came up with him to Jerusalem.
chr: ᎾᏍᎩ ᎾᏍᏉ ᎨᎵᎵ ᏤᏙᎮ ᎬᏩᏍᏓᏩᏗᏙᎮ ᎠᎴ ᎬᏩᏍᏕᎸᎯᏙᎮᎢ; ᎠᎴ ᎤᏂᏣᏖ ᏅᏩᎾᏓᎴ ᎠᏂᎨᏴ ᏥᎷᏏᎵᎻ ᏅᏓᎬᏩᏍᏓᏩᏙᎸᎯ.

source: And when it was evening, because it was the time of getting ready, that is, the day before the Sabbath,
chr: ᎿᏉᏃ ᎤᏒ ᏄᎵᏍᏔᏅ, ᎾᏍᎩ ᎠᏛᏅᎢᏍᏙᏗᏱ ᎨᏒ ᎢᏳᏍᏗ, ᎾᏍᎩ ᎤᎾᏙᏓᏈᏕᎾ ᎢᎦ ᎨᏒᎢ.

source: There came Joseph of Arimathaea, a responsible man in high honour, who was himself waiting for the kingdom of God; and he went in to Pilate without fear, and made a request for the body of Jesus.
chr: ᏦᏩ ᎠᎵᎹᏗᏱ ᎡᎯ ᎠᏥᎸᏉᏗ ᏗᎦᎳᏫᎩ, ᎾᏍᎩ ᎾᏍᏉ ᎠᎦᏘᏰ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎤᎷᎯᏍᏗᏱ, ᎾᏍᎩ ᎤᎷᏤᎢ, ᎠᎴ ᎾᏍᎦᎢᎲᎾ ᏭᏴᎴ ᏆᎴᏗᏱ, ᎠᎴ ᎤᏔᏲᎴ ᏥᏌ ᎠᏰᎸᎢ.

source: And Pilate was surprised that he was dead; and, sending for the captain, he put a question to see if he had been dead for long.
chr: ᏆᎴᏗᏃ ᎤᏍᏆᏏᎪᏎ ᎤᏜᏏᏛᎡᎮ ᎾᏞᎬ ᎤᏲᎱᏒᎢ; ᏭᏯᏅᎲᏃ ᎠᏍᎪᎯᏧᏈ ᏗᏘᏂᏙᎯ, ᎤᏛᏛᏁ, ᏰᎵᏍᎪ ᎪᎯᎩ ᎬᏩᏲᎱᏒᎯ, ᎤᏛᏁᎢ.

source: And when he had news of it from the captain, he let Joseph have the body.
chr: ᎬᏂᎨᏒᏃ ᏄᏩᏁᎸ ᎠᏍᎪᎯᏧᏈ ᏗᏘᏂᏙᎯ, ᏦᏩ ᏚᏲᎯᏎᎴ ᎠᏰᎸᎢ.

source: And he got a linen cloth and, taking him down, put the linen cloth round him, and put him in a place for the dead which had been cut out of a rock; and a stone was rolled against the door.
chr: ᎤᏩᏒᏃ ᎤᏏᏙᎵ ᏙᎴᏛ ᎠᏄᏬ, ᎠᎴ ᎤᏕᏒ ᎠᏰᎸᎢ, ᎠᎴ ᎠᏄᏬᎩᎯ ᏙᎴᏛ ᎤᏪᏣᏄᎳᏅ, ᎠᏤᎵᏍᏛ ᎤᏅᏁ ᎾᏍᎩ ᏅᏲᎯ ᎠᏍᎪᏒᎢ, ᎠᎴ ᏅᏯ ᎤᏪᏌᏆᎴᎴᎢ ᎠᏤᎵᏍᏛ ᎦᎶᎯᏍᏗᏱ ᎤᏁᎢ.

source: And Mary Magdalene and Mary, the mother of Joses, saw where he was put.
chr: ᎺᎵᏃ ᎹᎩᏕᎵ ᎡᎯ, ᎠᎴ ᎺᎵ ᏦᏏ ᎤᏥ ᎤᏂᎪᎮ ᎾᎿ ᎤᏂᏅᏅᎢ.

source: And when the Sabbath was past, Mary Magdalene and Mary, the mother of James, and Salome, got spices, so that they might come and put them on him.
chr: ᎤᎾᏙᏓᏆᏍᎬᏃ ᎤᎶᏐᏅ, ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ, ᎠᎴ ᎺᎵ ᏥᎻ ᎤᏥ ᎠᎴ ᏌᎶᎻ ᎤᏂᏩᏒᎯ ᎨᏎ ᎤᎦᎾᏍᏛ ᎦᏩᏒᎩ, ᎤᏂᎷᎯᏍᏗᏱ ᎤᏂᏰᎸᏎ ᎠᎴ ᎬᏩᎶᏁᏗᏱ.

source: And very early after dawn on the first day of the week, they came at the time of the coming up of the sun to the place where the body had been put.
chr: ᏑᎾᎴᎢᏳᏃ ᎢᎬᏱᏱ ᎢᎦ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒᎢ, ᎤᏂᎷᏤ ᎠᏤᎵᏍᏛ ᏨᏗᎧᎸᎪᏉ.

source: And they were saying among themselves, Who will get the stone rolled away from the door for us?
chr: ᎯᎠᏃ ᏂᏚᎾᏓᏪᏎᎴᎢ, ᎦᎪ ᏓᎩᎲᎡᎵ ᏅᏯ ᎠᏤᎵᏍᏛ ᎦᎶᎯᏍᏗᏱ ᎠᎲᎢ?

source: And looking up, they saw that the stone was rolled back; and it was of great size.
chr: ᏫᏚᎾᎧᎿᏅᏃ ᎤᏂᎪᎮ ᏅᏯ ᎠᎲᏛ ᎨᏒᎢ, ᎤᏣᏘᏰᏃ ᎡᏉᎯᏳ ᎨᏎᎢ.

source: And when they went in, they saw a young man seated on the right side, dressed in a white robe; and they were full of wonder.
chr: ᏭᏂᏴᎸᏃ ᎠᏤᎵᏍᏛᎢ, ᎤᏂᎪᎮ ᎠᏫᏴ ᎠᎦᏘᏏᏗᏢ ᎤᏬᎴᎢ, ᎤᏄᏪ ᎦᏅᎯᏛ ᎤᏁᎬ ᎠᏄᏬ; ᎠᏂᏍᎦᎢᎮᏃ.

source: And he said to them, Do not be troubled: you are looking for Jesus, the Nazarene, who has been put to death on the cross; he has come back from the dead; he is not here: see, the place where they put him!
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᏞᏍᏗ ᏱᏥᏍᎦᎢᎮᏍᏗ; ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ ᎡᏥᏲᎭ, ᎾᏍᎩ ᏣᎦᏛᎥᏍᎬᎩ; ᏚᎴᎯᏌᏅ; ᎥᏝ ᎠᏂ ᏱᎦᏅ; ᏗᏣᎧᏅᎦ Ꭰ ᎤᏂᏅᏅᎢ.

source: But go, say to his disciples and to Peter, He goes before you into Galilee: there you will see him, as he said to you.
chr: ᎠᏎᏃ ᏥᏤᎾ, ᎠᎴ ᏫᏗᏥᏃᎲᏏ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎠᎴ ᏈᏓ ᎾᏍᎩ ᎢᎬᏱ ᏫᏚᎶᎯᏎᏗᏱ ᎨᎵᎵ; ᎾᎿ ᏓᏰᏥᎪᎢ, ᎾᏍᎩᏯ ᏂᏥᏪᏎᎸᎢ.

source: And they went out quickly from the place, because fear and great wonder had come on them: and they said nothing to anyone, because they were full of fear that ...
chr: ᎤᎵᏍᏗᏃ ᎤᏂᏄᎪᏨ ᏚᎾᎵᏖᏎ ᎠᏤᎵᏍᏛᎢ; ᏚᏂᎾᏫᏍᎨᏰᏃ ᎠᎴ ᎤᏂᏍᏆᏂᎪᏍᎨᎢ; ᎥᏝ ᎠᎴ ᎩᎶ ᎪᎱᏍᏗ ᏳᏃᏎᎴᎢ; ᎠᏂᏍᎦᎢᎮᏰᏃ.

source: Now when he came back from the dead early on the first day of the week, he went first to Mary Magdalene, from whom he had sent out seven evil spirits.
chr: ᏥᏌᏃ ᏚᎴᎯᏌᏅ ᏑᎾᎴᎢᏳ ᎢᎬᏱᏱ ᎢᎦ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒᎢ, ᎢᎬᏱ ᎬᏂᎨᏒ ᏄᏛᏁᎴ ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ, ᎾᏍᎩ ᎦᎵᏉᎩ ᎠᏂᏍᎩᎾ ᏥᏚᏄᎪᏫᏎᎴᎢ.

source: She went and gave news of it to those who had been with him, while they were sorrowing and weeping.
chr: ᎾᏍᎩᏃ ᎤᏪᏅ ᎤᏁᏙᎸᎯ ᏫᏚᏃᏁᎴ ᎤᏲ ᏚᎾᏓᏅᏛᎢ ᎠᎴ ᏓᎾᏠᏱᎲᎢ.

source: And they, when it came to their ears that he was living, and had been seen by her, had no belief in it.
chr: ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅ ᎬᏅᎢ, ᎠᎴ ᎾᏍᎩ ᎤᎪᎲᎢ, ᎥᏝ ᏳᏃᎯᏳᏁᎢ.

source: And after these things he was seen in another form by two of them, while they were walking on their way into the country.
chr: ᎣᏂᏃ ᏅᏩᏓᎴ ᏄᏍᏕ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎴ ᎠᏂᏔᎵ ᎾᎿ ᎠᏁᎳ ᎠᎾᎢᏎᎢ, ᏙᏗᎦᎶᎨᏒ ᏩᏂᎦᏖᎢ.

source: And they went away and gave news of it to the rest; and they had no belief in what was said.
chr: ᎾᏍᎩᏃ ᎤᏁᏅ ᏫᏚᏂᏃᏁᎴ ᎠᏂᏐᎢ; ᎾᏍᏉ ᎥᏝ ᏱᏚᏃᎯᏳᏁ ᎾᏍᎩ.
